In [30]:
import pandas as pd
df = pd.read_csv('haberman.csv')
df

     age  year  nodes  status
0     30    64      1       1
1     30    62      3       1
2     30    65      0       1
3     31    59      2       1
4     31    65      4       1
..   ...   ...    ...     ...
300   74    63      0       1
301   75    62      1       1
302   76    67      0       1
303   77    65      3       1
304   78    65      1       2

[305 rows x 4 columns]

In [5]:
df.head()

   age  year  nodes  status
0   30    64      1       1
1   30    62      3       1
2   30    65      0       1
3   31    59      2       1
4   31    65      4       1

In [6]:
df['age'].unique()

array([30, 31, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47,
       48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64,
       65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78])

In [28]:
df['age'].value_counts()

age
52    14
54    13
50    12
43    11
47    11
53    11
57    11
38    10
49    10
55    10
41    10
65    10
42     9
45     9
61     9
63     8
59     8
70     7
34     7
46     7
62     7
56     7
58     7
48     7
44     7
51     6
60     6
67     6
37     6
39     6
66     5
64     5
69     4
72     4
40     3
30     3
33     2
31     2
36     2
35     2
68     2
73     2
74     2
71     1
75     1
76     1
77     1
78     1
Name: count, dtype: int64

In [8]:
df.describe()

              age        year       nodes      status
count  305.000000  305.000000  305.000000  305.000000
mean    52.357377   62.868852    4.032787    1.262295
std     10.678010    3.242783    7.200528    0.440605
min     30.000000   58.000000    0.000000    1.000000
25%     44.000000   60.000000    0.000000    1.000000
50%     52.000000   63.000000    1.000000    1.000000
75%     60.000000   66.000000    4.000000    2.000000
max     78.000000   69.000000   52.000000    2.000000

In [9]:
df.corr()

             age      year     nodes    status
age     1.000000  0.105192 -0.061375  0.053424
year    0.105192  1.000000 -0.005169  0.003435
nodes  -0.061375 -0.005169  1.000000  0.289670
status  0.053424  0.003435  0.289670  1.000000

In [ ]:
df.shape
# row, column

(305, 4)

In [10]:
df['age'].max()

np.int64(78)

In [11]:
df['nodes'].min()

np.int64(0)

In [12]:
df['year'].median()

np.float64(63.0)

In [13]:
df['year'].mean()

np.float64(62.868852459016395)

In [14]:
df['year'].mode()

0    58
Name: year, dtype: int64

In [31]:
df.drop('nodes',axis=1) 
# dropping a column just once to check

     age  year  status
0     30    64       1
1     30    62       1
2     30    65       1
3     31    59       1
4     31    65       1
..   ...   ...     ...
300   74    63       1
301   75    62       1
302   76    67       1
303   77    65       1
304   78    65       2

[305 rows x 3 columns]

In [16]:
df.head(2)

   age  year  nodes  status
0   30    64      1       1
1   30    62      3       1

In [ ]:
# permanently drop
# df = df.drop('nodes',axis=1)
# df.head(2)

In [17]:
# if don't input any number set it in non value number and drop this row
# df = df.dropna()
age_df = df[df['age'] == 64]
age_df.head()

     age  year  nodes  status
253   64    58      0       1
254   64    65     22       1
255   64    66      0       1
256   64    61      0       1
257   64    68      0       1

In [19]:
gb= df.groupby("age")
gb.get_group(38).set_index("year").head(10)

      age  nodes  status
year
69     38     21       2
59     38      2       1
60     38      0       1
60     38      0       1
62     38      3       1
64     38      1       1
66     38      0       1
66     38     11       1
60     38      1       1
67     38      5       1

In [20]:
df.loc[2:4]

   age  year  nodes  status
2   30    65      0       1
3   31    59      2       1
4   31    65      4       1

In [21]:
# first section defines row
# second section defines column
df.iloc[0:3, 0:2]

   age  year
0   30    64
1   30    62
2   30    65

In [22]:
df[df['age']<=40]

    age  year  nodes  status
0    30    64      1       1
1    30    62      3       1
2    30    65      0       1
3    31    59      2       1
4    31    65      4       1
5    33    58     10       1
6    33    60      0       1
7    34    59      0       2
8    34    66      9       2
9    34    58     30       1
10   34    60      1       1
11   34    61     10       1
12   34    67      7       1
13   34    60      0       1
14   35    64     13       1
15   35    63      0       1
16   36    60      1       1
17   36    69      0       1
18   37    60      0       1
19   37    63      0       1
20   37    58      0       1
21   37    59      6       1
22   37    60     15       1
23   37    63      0       1
24   38    69     21       2
25   38    59      2       1
26   38    60      0       1
27   38    60      0       1
28   38    62      3       1
29   38    64      1       1
30   38    66      0       1
31   38    66     11       1
32   38    60      1       1
33   38    67      5       1
34   39    66      0       2
35   39    63      0       1
36   39    67      0       1
37   39    58      0       1
38   39    59      2       1
39   39    63      4       1
40   40    58      2       1
41   40    58      0       1
42   40    65      0       1

In [23]:
for x in df:
    print(x)

age
year
nodes
status

In [25]:
for age in df['age']:
    if age > 40 and age <= 78 :
        print(age)

41
41
41
41
41
41
41
41
41
41
42
42
42
42
42
42
42
42
42
43
43
43
43
43
43
43
43
43
43
43
44
44
44
44
44
44
44
45
45
45
45
45
45
45
45
45
46
46
46
46
46
46
46
47
47
47
47
47
47
47
47
47
47
47
48
48
48
48
48
48
48
49
49
49
49
49
49
49
49
49
49
50
50
50
50
50
50
50
50
50
50
50
50
51
51
51
51
51
51
52
52
52
52
52
52
52
52
52
52
52
52
52
52
53
53
53
53
53
53
53
53
53
53
53
54
54
54
54
54
54
54
54
54
54
54
54
54
55
55
55
55
55
55
55
55
55
55
56
56
56
56
56
56
56
57
57
57
57
57
57
57
57
57
57
57
58
58
58
58
58
58
58
59
59
59
59
59
59
59
59
60
60
60
60
60
60
61
61
61
61
61
61
61
61
61
62
62
62
62
62
62
62
63
63
63
63
63
63
63
63
64
64
64
64
64
65
65
65
65
65
65
65
65
65
65
66
66
66
66
66
67
67
67
67
67
67
68
68
69
69
69
69
70
70
70
70
70
70
70
71
72
72
72
72
73
73
74
74
75
76
77
78

In [32]:
df[df['age'] == 30]

   age  year  nodes  status
0   30    64      1       1
1   30    62      3       1
2   30    65      0       1